# Benz√≠n Brno - Globus - Natural
Url: <https://www.globus.cz/brno/cerpaci-stanice-a-myci-linka.html>

In [1]:
import requests
from bs4 import BeautifulSoup
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from unicodedata import normalize

# requests - nacte stranku 
url = r'https://www.globus.cz/brno/cerpaci-stanice-a-myci-linka.html'
url = r'https://bit.ly/3oBvorr'
headers = {'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/85.0.4183.102 Safari/537.36'}
r = requests.get(url, headers)
# r.content
# BeautifulSoup - ted nepotrebuji neni JavaScript 
# soup = BeautifulSoup(r.content, 'html.parser')

In [2]:
# pd najde tabulky 
# table_MN = pd.read_html('https://en.wikipedia.org/wiki/Minnesota', match='Election results from statewide races')
table = pd.read_html(r.content) 
print(f'Total tables: {len(table)}')

Total tables: 6

In [3]:
# tabulek je 6, zajima me c. 2
table[1]

                    0   1     2
0          Natural 95 NaN  3630
1              Diesel NaN  3490
2      Diesel plus  i NaN  3590
3  Natural 95 plus  i NaN  3730
4              AdBlue NaN  2990

In [4]:
df = table[1]
type(df)

pandas.core.frame.DataFrame

In [5]:
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       5 non-null      object
 1   1       0 non-null      float64
 2   2       5 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

                    0   1     2
0          Natural 95 NaN  3630
1              Diesel NaN  3490
2      Diesel plus  i NaN  3590
3  Natural 95 plus  i NaN  3730
4              AdBlue NaN  2990

In [6]:
# adding column name to the respective columns - https://bit.ly/3oxfuhN
df.columns =['Name', 'smazat', 'Cena']

In [7]:
# smazani sloupce - https://bit.ly/3oBNYjk
# old syntax 
# df = df.drop('smazat', 1) # 

# smazani sloupce - https://bit.ly/3oBNYjk
del df['smazat']

In [8]:
df['Cena']

0    3630
1    3490
2    3590
3    3730
4    2990
Name: Cena, dtype: int64

In [9]:
# Cena zmena typu na float - https://bit.ly/3Bi79SL
df['Cena'] = df['Cena'].astype('float64')

In [10]:
# Prepocitani df tj. / 100 
df['Cena'] =  (df['Cena'] / 100)
df['Cena']

0    36.3
1    34.9
2    35.9
3    37.3
4    29.9
Name: Cena, dtype: float64

In [11]:
# How to add a trailing zeros to a pandas dataframe column? - https://bit.ly/3D5zwUO
df['Cena'] =  df['Cena'].map('{:.2f}'.format)
df['Cena']

0    36.30
1    34.90
2    35.90
3    37.30
4    29.90
Name: Cena, dtype: object

In [12]:
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Cena    5 non-null      object
dtypes: object(2)
memory usage: 208.0+ bytes

                 Name   Cena
0          Natural 95  36.30
1              Diesel  34.90
2      Diesel plus  i  35.90
3  Natural 95 plus  i  37.30
4              AdBlue  29.90

In [25]:
# LookUp - nalezeni hodnoty Key - https://bit.ly/3DuT59p
Key = 'Drive 95' 
Key = 'Natural 95' # zmena media - 26.10.2021 13:15
Radek = df.loc[df['Name'] == Key]
# How to get a value from a Pandas DataFrame and not the index and object type - https://bit.ly/3BhmuDc
Cena =  Radek['Cena'].values[0]
print('Cena:',type (Cena), Cena)

Cena: <class 'str'> 36.30

In [26]:
# Vysledek 
print('Cena paliva -', Key, '- je:', Cena )

Cena paliva - Natural 95 - je: 36.30

## End.
Moje pozn√°mky - Notes 


VSCode: Jupyter won't export as Python script - https://bit.ly/3iDoH4B
  pip install nbconvert
  pip install pandoc
  pip install pyppeteer